tutorials/icoDyMFoam/newMovingCone/0/motionDiff
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/coyote/hjasak/OpenFOAM/OpenFOAM-1.1/tutorials/icoFoamAutoMotion";
    case "newMovingCone";
    instance "0";
    local "";

    class elementScalarField;
    object motionDiff;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform      List<scalar> 
1900
(
1
1
1
1
1
1
1
1
...
)
;


boundaryField
{
    movingWall
    {
        type            calculated;
    }
    farFieldMoving
    {
        type            calculated;
    }
    fixedWall
    {
        type            calculated;
    }
    axis
    {
        type            empty;
    }
    left
    {
        type            calculated;
    }
    farField
    {
        type            calculated;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
